tap "aws/tap"
tap "dokku/repo"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "saulpw/vd"
tap "teamookla/speedtest"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Official Amazon AWS command-line interface
brew "awscli"
# Core application library for C
brew "glib"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# C library implementing the SSH2 protocol
brew "libssh2"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Text processing system for reStructuredText
brew "docutils"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Libpcap-based NetFlow probe
brew "fprobe"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Image manipulation
brew "netpbm"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Render and include figures in Pandoc documents using many plotting toolkits
brew "pandoc-plot"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Persistent key-value database, with built-in net interface
brew "redis"
# Steel Bank Common Lisp system
brew "sbcl"
# SMART hard drive monitoring
brew "smartmontools"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line client for the Dokku PaaS
brew "dokku/repo/dokku"
# Terraform
brew "hashicorp/tap/terraform"
# Terminal utility for exploring and arranging tabular data
brew "saulpw/vd/visidata"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Sheet music editor software for guitar, bass, keyboards, drums and more
cask "guitar-pro"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie-desktop"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Desktop application for JupyterLab
cask "jupyterlab-app"
# Open-source, KeePass-client and password manager
cask "macpass"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Client-side GUI application for modern database development and operations
cask "nosql-workbench"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# GUI for streamlined Redis application development
cask "redis-insight"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source media center
cask "stremio"
# Text editor for code, markup and prose
cask "sublime-text"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
